In [2]:
import pandas as pd

In [20]:
list1 = ["Nadir Ali", "Mustaqeem", "Hassan"]
s1 = pd.Series(list1, index=[1,2,3])
s1.index.name = "S:No"
s1

S:No
1    Nadir Ali
2    Mustaqeem
3       Hassan
dtype: object

In [40]:
names = pd.DataFrame({
    "Name:": ['Nadir Ali', 'Irshad Ali', 'Farman'],
    "Age:" : [20, 44, 21],
    "City" : ['Sukkur', 'KHI','ISB'],
    "Salary": [10000, 20000, 3000]
                     })
# names.index.name = "S:No"

# print(names)
csv = names.to_csv("data.csv")
names

        Name:  Age:    City  Salary
0   Nadir Ali    20  Sukkur   10000
1  Irshad Ali    44     KHI   20000
2      Farman    21     ISB    3000

'Nadir ALi'

In [42]:
data = pd.DataFrame( {
 'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Ella'],
 'Age': [25, 30, 35, 40, 29],
 'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
 'Salary': [70000, 80000, 120000, 110000, 95000]
})
data.to_csv("employees.csv")

In [44]:
dt = pd.read_csv('data.csv')
dt

   Unnamed: 0       Name:  Age:
0           0   Nadir Ali    20
1           1  Irshad Ali    44
2           2      Farman    21